OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/placement/8-global.def
[INFO ODB-0128] Design: manual_macro_placement_test
[INFO ODB-0130]     Created 74 pins.
[INFO ODB-0131]     Created 935 components and 2382 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 2310 connections.
[INFO ODB-0133]     Created 72 nets and 72 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/placement/8-global.def
###############################################################################
# Created by write_sdc
# Wed Jun 22 21:31:27 2022
###############################################################################
current_design manual_macro_placement_test
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk2 -period 100.0000 [get_ports {clk1}]
set_input_delay 20.0000 -add_delay [get_ports {x1[0]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[10]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[11]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[12]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[13]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[14]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[15]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[16]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[17]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[18]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[19]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[1]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[20]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[21]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[22]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[23]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[24]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[25]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[26]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[27]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[28]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[29]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[2]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[30]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[31]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[3]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[4]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[5]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[6]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[7]}]
set_input_delay 20.0000 -add_delay [get_ports {x1[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x1[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {x2[9]}]
set_input_delay 20.0000 -add_delay [get_ports {y1}]
set_input_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {y2}]
set_output_delay 20.0000 -add_delay [get_ports {p1}]
set_output_delay 20.0000 -clock [get_clocks {clk2}] -add_delay [get_ports {p2}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0177 [get_ports {p1}]
set_load -pin_load 0.0177 [get_ports {p2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 69 input buffers.
[INFO RSZ-0028] Inserted 2 output buffers.
[INFO RSZ-0058] Using max wire length 3048um.
[INFO RSZ-0039] Resized 56 instances.
Placement Analysis
---------------------------------
total displacement        759.8 u
average displacement        0.8 u
max displacement           78.3 u
original HPWL           18631.3 u
legalized HPWL          19606.7 u
delta HPWL                    5 %

[INFO DPL-0020] Mirrored 26 instances
[INFO DPL-0021] HPWL before           19606.7 u
[INFO DPL-0022] HPWL after            19564.7 u
[INFO DPL-0023] HPWL delta               -0.2 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: clk1 (clock source 'clk2')
Endpoint: spm_inst_0/clk (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.00    0.00   50.00 v clk1 (in)
     1    0.00                           clk1 (net)
                  0.00    0.00   50.00 v spm_inst_0/clk (spm)
                                 50.00   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk2
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          5.95e-07   1.16e-06   1.10e-09   1.75e-06 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  5.95e-07   1.16e-06   1.10e-09   1.75e-06 100.0%
                          33.9%      66.0%       0.1%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 33904 u^2 38% utilization.
area_report_end
