OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/tmp/merged.unpadded.nom.lef
[WARNING ORD-1011] LEF master spm has no liberty cell.
###############################################################################
# Created by write_sdc
# Wed Oct  6 21:55:22 2021
###############################################################################
current_design manual_macro_placement_test
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk1  -period 100.0000 [get_ports {clk1}]
create_clock -name clk2  -period 100.0000 [get_ports {clk1}]
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[0]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[10]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[11]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[12]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[13]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1] -add_delay [get_ports {x1[14]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[15]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[16]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[17]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[18]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[19]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[1]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[20]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[21]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[22]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[23]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[24]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[25]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[26]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[27]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[28]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[29]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[2]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[30]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[31]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[3]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[4]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[5]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[6]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[7]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {x1[8]}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x1[9]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[0]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[10]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[11]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[12]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[13]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[14]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[15]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[16]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[17]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[18]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[19]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[1]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[20]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[21]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[22]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[23]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[24]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[25]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[26]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[27]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[28]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[29]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[2]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[30]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[31]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[3]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[4]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[5]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[6]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[7]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[8]}]
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {x2[9]}]
set_input_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {y1}]
[WARNING STA-0323] clock 'clk1' not found.
set_input_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {y2}]
set_output_delay 20.0000 -clock [get_clocks clk1]  -add_delay [get_ports {p1}]
[WARNING STA-0323] clock 'clk1' not found.
set_output_delay 20.0000 -clock [get_clocks clk2]  -add_delay [get_ports {p2}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0177 [get_ports {p1}]
set_load -pin_load 0.0177 [get_ports {p2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x2[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO IFP-0001] Added 110 rows of 654 sites.
[INFO] Extracting DIE_AREA and CORE_AREA from the floorplan
[INFO] Floorplanned on a die area of 0.0 0.0 312.06 322.78 (microns). Saving to /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/reports/floorplan/3-initial_fp_die_area.rpt.
[INFO] Floorplanned on a core area of 5.52 10.88 306.36 310.08 (microns). Saving to /openlane/designs/manual_macro_placement_test/runs/RUN_2022.06.22_21.31.23/reports/floorplan/3-initial_fp_core_area.rpt.
